tap "thoughtbot/formulae"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

# Unix
brew "universal-ctags", args: ["HEAD"]
brew "git"
brew "openssl"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watchman"
brew "zsh"
brew "jq"
brew "cmake"
brew "gpg"
brew "wget"

# No More App Store
brew "mas"

# Heroku
brew "heroku-toolbelt"
brew "parity"

# GitHub
brew "hub"

# Image manipulation
brew "imagemagick"

# Programming languages
brew "coreutils"
brew "libyaml" # should come after openssl

# Databases
brew "redis", restart_service: true

# Casks
cask_args appdir: '/Applications'
tap 'caskroom/cask'
cask '1password'
cask 'alfred'
cask 'atom'
cask 'carbon-copy-cloner'
cask 'cleanmymac'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'gpg-suite'
cask 'iterm2'
cask 'karabiner-elements'
cask 'little-snitch'
cask 'omnifocus'
cask 'postgres'
cask 'postgres'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'vlc'
cask 'zoomus'
